nutella/app/controllers/product_category_controller.rb

  def create
  	product_category = ProductCategory.new(product_category_params)
  	if product_category.save
---
INSERT INTO "product_categories" ("name", "description") VALUES (?, ?)  [["name", "chocolate"], ["description", "buen chocolate"]]

  def update
  	product_category = ProductCategory.find(params['id'])
  	if product_category.update(product_category_params)
---
SELECT  "product_categories".* FROM "product_categories" WHERE "product_categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "product_categories" SET "name" = ? WHERE "product_categories"."id" = ?  [["name", "chocolate1"], ["id", 2]]

  def delete
  	product_category = ProductCategory.find(params['id'])
  	if product_category.destroy
---
SELECT  "product_categories".* FROM "product_categories" WHERE "product_categories"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "product_categories" WHERE "product_categories"."id" = ?  [["id", 3]]