nutella/app/controllers/product_controller.rb

   def create
  	product = Product.new(product_params)
  	if product.save
---
INSERT INTO "products" ("name", "price", "stock", "product_category_id") VALUES (?, ?, ?, ?)  [["name", "nutella"], ["price", 1], ["stock", 100], ["product_category_id", 1]]

  def update
  	product = Product.find(params['id'])
  	if product.update(product_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "products" SET "name" = ? WHERE "products"."id" = ?  [["name", "nutella8"], ["id", 11]]

  def delete
  	product = Product.find(params['id'])
  	if product.destroy
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 11]]

  def find
  	if Product.exists?(params['id'])
  		return render json: Product.find(params['id'])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]

  def list
  	render json: Product.all()
---
SELECT "products".* FROM "products"