nutella/app/controllers/purchase_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "hector"], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "hector"], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "purchases" ("date", "total", "user_id", "product_id") VALUES (?, ?, ?, ?)  [["date", "2019-07-04"], ["total", 10.0], ["user_id", 1], ["product_id", 1]]
---
  def create
  	if User.exists?(username: params['username'])
	  	user = User.find_by(username: params['username'])
	  	if user.password === params['password']
		  	product = Product.find(params['product_id'])
	  		purchase = Purchase.new(date: DateTime.now.to_formatted_s(:db), total: product.price, user_id: user.id, product_id: product.id)
		  	if purchase.save