nutella/app/controllers/user_controller.rb

  def create
  	user = User.new(user_params)
  	if user.save
---
INSERT INTO "users" ("name", "username", "password") VALUES (?, ?, ?)  [["name", "hector"], ["username", "hector"], ["password", "123"]]

  def update
  	user = User.find(params['id'])
  	if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ? WHERE "users"."id" = ?  [["name", "hector2"], ["id", 2]]

  def delete
  	user = User.find(params['id'])
  	if user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]

  def find
  	if User.exists?(params['id'])
  		return render json: User.find(params['id'])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]